{
  "schema_version": "1.0",
  "framework": {
    "key": "competency_coach",
    "name": "Competency Coach DNA Blueprint",
    "report": {
      "report_title": "Competency Coach DNA Blueprint",
      "welcome_title": "Welcome to your DNA Blueprint",
      "welcome_body": [
        "Welcome to your Competency Coach DNA Blueprint. This report gives you a clear and practical view of how you naturally think, communicate and create impact as a coach or leader.",
        "Your ability to help others transform starts with understanding your own instincts, patterns and strengths. This blueprint highlights how your natural energy shows up in real situations so you can work more intentionally and sustainably.",
        "This is not a label or a judgement. Instead, see it as a working document – a shared language you can use with clients, colleagues or mentors to clarify your strengths, stretch areas and coaching focus.",
        "Use this report to reflect on what energises you, where you create the most impact and how you can continue developing your coaching mastery."
      ],
      "how_to_use": {
        "summary": "This report is a snapshot of your natural patterns, not a fixed identity. Use it as a starting point for reflection, coaching and conversation.",
        "bullets": [
          "Highlight 2–3 sentences that feel most true for you.",
          "Notice one strength you want to bring forward more deliberately.",
          "Identify one development area you would like to work on in the next month.",
          "Discuss this blueprint with a coach, supervisor or trusted peer."
        ]
      },
      "framework_title": "The Competency Coach framework",
      "framework_intro": [
        "The Competency Coach DNA Blueprint combines four core Frequencies with eight Profiles. The Frequencies describe the underlying energy you bring to thinking, relating and taking action. The Profiles blend those Frequencies into recognisable patterns of contribution.",
        "This framework is designed specifically for coaches and people-focused leaders. It gives you language for the kind of coach you are at your best, and where your natural instincts might need balancing, support or conscious stretching.",
        "There is no ‘right’ or ‘wrong’ profile. Each combination brings value in different contexts. Your job is not to become all things to all people, but to understand your own pattern so you can work in a way that is sustainable, ethical and effective.",
        "As you read through this report, notice where your DNA Blueprint is already aligned with how you work, and where there might be gaps between your natural style and the expectations of your role, environment or clients."
      ],
      "frequencies_copy": {
        "title": "Understanding the four Frequencies",
        "intro": "Frequencies describe the way you naturally think, decide and take action – your coaching energy.",
        "items": {
          "A": {
            "name": "Innovation",
            "description": "Ideas, models, frameworks and new ways of approaching problems."
          },
          "B": {
            "name": "Influence",
            "description": "Connection, communication, motivation and facilitation."
          },
          "C": {
            "name": "Implementation",
            "description": "Structure, process, rhythm and consistent follow-through."
          },
          "D": {
            "name": "Insight",
            "description": "Observation, reflection, analysis and deeper understanding."
          }
        }
      },
      "profiles_copy": {
        "title": "Understanding the eight Profiles",
        "intro": "Profiles blend the Frequencies into distinct coaching patterns – the ways you naturally create value in sessions, relationships and results.",
        "items": {
          "PROFILE_1": {
            "name": "Innovator",
            "one_liner": "Generates ideas, sees possibilities and designs new ways forward."
          },
          "PROFILE_2": {
            "name": "Storyteller",
            "one_liner": "Uses stories, language and narrative to unlock insight and action."
          },
          "PROFILE_3": {
            "name": "Heart-Centred Coach",
            "one_liner": "Holds space with care, empathy and deep presence."
          },
          "PROFILE_4": {
            "name": "Negotiator",
            "one_liner": "Finds common ground, balances needs and helps resolve tension."
          },
          "PROFILE_5": {
            "name": "Grounded Guide",
            "one_liner": "Brings steadiness, structure and practical next steps."
          },
          "PROFILE_6": {
            "name": "Thinker",
            "one_liner": "Asks thoughtful questions and helps clients see patterns clearly."
          },
          "PROFILE_7": {
            "name": "Mastermind",
            "one_liner": "Connects strategy, systems and long-term direction."
          },
          "PROFILE_8": {
            "name": "Change Agent",
            "one_liner": "Supports transformation, challenge and meaningful shifts."
          }
        }
      },
      "how_to_read_scores": {
        "title": "How to read these scores",
        "bullets": [
          "Higher percentages highlight patterns you use naturally and with ease.",
          "Lower percentages highlight styles you can use when needed, but which may take more energy.",
          "Your primary profile is your natural centre of gravity in coaching.",
          "Your secondary and tertiary profiles show useful complementary strengths."
        ]
      },
      "profile_language": {
        "primary_label": "Primary profile",
        "secondary_label": "Secondary profile",
        "tertiary_label": "Tertiary profile"
      },
      "images": {
        "framework_banner": "/images/competency-coach/report-header.png",
        "frequency_diagram": "/org-graphics/tp-4frequencies.png",
        "profile_grid": "/images/competency-coach/profile-grid.png"
      },
      "profiles": {
        "PROFILE_1": {
          "one_liner": "Generates ideas, sees possibilities and designs new ways forward.",
          "traits": [
            "Spots opportunities and new angles quickly.",
            "Enjoys playing with concepts, tools and models.",
            "Likes to design offers, frameworks or journeys that feel unique and tailored."
          ],
          "motivators": [
            "Space to experiment, iterate and create.",
            "Clients who are open to new approaches and change.",
            "Work that feels meaningful, not just ‘by the book’."
          ],
          "blind_spots": [
            "Can generate more ideas than can realistically be implemented.",
            "May move on too quickly, before changes are embedded for the client.",
            "Can become impatient with repetition or maintenance work."
          ],
          "example": "As an Innovator, you’re often the person who brings fresh thinking into a coaching relationship – reframing problems, introducing powerful tools and designing new ways forward when a client feels stuck."
        },
        "PROFILE_2": {
          "one_liner": "Uses stories, language and narrative to unlock insight and action.",
          "traits": [
            "Communicates in a way that is engaging and easy to understand.",
            "Helps clients reframe their story and see themselves differently.",
            "Uses metaphor, examples and lived experience to bring concepts to life."
          ],
          "motivators": [
            "Space to share, speak and co-create understanding with clients.",
            "Conversations that feel honest, human and real.",
            "Opportunities to use content, teaching or speaking as part of coaching."
          ],
          "blind_spots": [
            "May over-share or talk more than listen when under pressure.",
            "Can rely on ‘tried and tested’ stories instead of staying with the client’s unique experience.",
            "Might avoid silence or depth if it feels uncomfortable."
          ],
          "example": "As a Storyteller, you’re the coach who helps clients find language for their experience. You translate complex ideas into something tangible, helping people see what’s really going on and what is possible next."
        },
        "PROFILE_3": {
          "one_liner": "Holds space with care, empathy and deep presence.",
          "traits": [
            "Creates a sense of safety and emotional permission.",
            "Listens deeply to what is said and unsaid.",
            "Tunes into feelings, values and the human experience of change."
          ],
          "motivators": [
            "Relational depth and genuine connection with clients.",
            "Work that honours humanity, dignity and emotional truth.",
            "Time and space to go beyond surface-level goals into what really matters."
          ],
          "blind_spots": [
            "May take on too much emotional responsibility for the client.",
            "Can find it hard to hold firm boundaries when someone is struggling.",
            "Might delay challenging conversations for fear of damaging the relationship."
          ],
          "example": "As a Heart-Centred Coach, you are often the person clients turn to when they need to feel seen, heard and accepted. You create the conditions where real vulnerability and honest growth can happen."
        },
        "PROFILE_4": {
          "one_liner": "Finds common ground, balances needs and helps resolve tension.",
          "traits": [
            "Sees multiple perspectives in a situation.",
            "Comfortable navigating tension, conflict or competing needs.",
            "Looks for practical agreements and next steps everyone can live with."
          ],
          "motivators": [
            "Situations where resolution and harmony are possible.",
            "Working with teams, partnerships or complex stakeholder environments.",
            "Being part of conversations where your presence genuinely makes things easier."
          ],
          "blind_spots": [
            "May over-focus on harmony and avoid necessary conflict.",
            "Can spend a lot of energy keeping everyone ‘on board’ rather than choosing a clear direction.",
            "Might compromise their own needs or values to keep the peace."
          ],
          "example": "As a Negotiator, you excel when there are moving parts, personalities and pressures to balance. You help clients navigate tricky dynamics and move towards outcomes that feel fair and workable."
        },
        "PROFILE_5": {
          "one_liner": "Brings steadiness, structure and practical next steps.",
          "traits": [
            "Turns ideas and insight into concrete plans.",
            "Helps clients break big goals into manageable actions.",
            "Provides consistency, reliability and follow-through in the coaching process."
          ],
          "motivators": [
            "Clear goals, expectations and agreements.",
            "Seeing clients follow through and implement what they’ve committed to.",
            "Roles where you can bring order, rhythm and predictability to the work."
          ],
          "blind_spots": [
            "May become overly focused on tasks and checklists.",
            "Can under-value exploration, intuition or fluidity.",
            "Might judge themselves or clients harshly when plans slip."
          ],
          "example": "As a Grounded Guide, you help clients turn vision into reality. You are often the one who says, “Okay, what does this mean for the next week or month?” and supports them to stick with the work."
        },
        "PROFILE_6": {
          "one_liner": "Asks thoughtful questions and helps clients see patterns clearly.",
          "traits": [
            "Analyses situations carefully and logically.",
            "Notices patterns, assumptions and inconsistencies.",
            "Supports clients to step back and think things through."
          ],
          "motivators": [
            "Time to reflect, process and consider options.",
            "Clients who are willing to think deeply and explore complexity.",
            "Work that values insight, clarity and intellectual honesty."
          ],
          "blind_spots": [
            "May stay in analysis when action is needed.",
            "Can come across as detached or overly ‘heady’ if not tuned into emotion.",
            "Might over-question, which can feel destabilising for some clients."
          ],
          "example": "As a Thinker, you bring rigour and depth to coaching. You help clients slow down, examine their assumptions and make decisions that are considered rather than reactive."
        },
        "PROFILE_7": {
          "one_liner": "Connects strategy, systems and long-term direction.",
          "traits": [
            "Sees the bigger picture and how pieces fit together.",
            "Thinks in terms of pathways, frameworks and longer-term impact.",
            "Supports clients to align decisions with vision and strategy."
          ],
          "motivators": [
            "Conversations about purpose, direction and long-term outcomes.",
            "Opportunities to design journeys, programs or ecosystems.",
            "Work where strategic thinking is genuinely valued."
          ],
          "blind_spots": [
            "May under-estimate the emotional or practical realities of the moment.",
            "Can feel frustrated when others focus only on short-term issues.",
            "Might over-complicate things with too much structure or strategy."
          ],
          "example": "As a Mastermind, you’re drawn to seeing how all the moving parts connect. You help clients understand not just what to do next, but how it fits into a bigger arc of change."
        },
        "PROFILE_8": {
          "one_liner": "Supports transformation, challenge and meaningful shifts.",
          "traits": [
            "Comfortable inviting clients into stretch, change and discomfort.",
            "Holds a strong vision of what is possible and speaks to it.",
            "Helps clients make decisions that are aligned with their deeper truth."
          ],
          "motivators": [
            "Work that feels purposeful and change-focused.",
            "Clients who are genuinely ready to grow and act.",
            "Spaces where honest challenge is welcomed, not shut down."
          ],
          "blind_spots": [
            "May push too hard, too fast when others are not ready.",
            "Can become impatient with incremental progress.",
            "Might under-estimate the need for stability, safety or small steps."
          ],
          "example": "As a Change Agent, you are often the catalyst in someone’s story. You are drawn to pivotal moments and are at your best when supporting clients to cross thresholds and commit to meaningful change."
        }
      },
      "energy_matrix": {
        "title": "Energy mix – how your Profiles work together",
        "body": "Your primary, secondary and tertiary Profiles combine to create your unique coaching energy mix. Your primary Profile represents your default mode under pressure. Your secondary Profile shows a strong supporting pattern you can lean into, and your tertiary Profile is a backup style that becomes more available as you consciously develop it."
      }
    }
  }
}

